We need to start by importing Pandas. It's standard practice to nickname it pd

In [2]:
import pandas as pd

We will now read the titanic.csv into a DataFrame using the read_csv function.

In [3]:
df = pd.read_csv('https://sololearn.com/uploads/files/titanic.csv')

Now we will take a look at this data

In [4]:
df.head()

   Survived  Pclass     Sex   Age  Siblings/Spouses  Parents/Children     Fare
0         0       3    male  22.0                 1                 0   7.2500
1         1       1  female  38.0                 1                 0  71.2833
2         1       3  female  26.0                 0                 0   7.9250
3         1       1  female  35.0                 1                 0  53.1000
4         0       3    male  35.0                 0                 0   8.0500

We can also summarize the data as below.

In [5]:
df.describe()

,Survived,Pclass,Age,Siblings/Spouses,Parents/Children,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

We can also read a single column from the data. This is called a Pandas Series. 

DataFrames are Tabular structures whereas Series is a single column.

In [6]:
col = df['Fare']
print(col)

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
882    13.0000
883    30.0000
884    23.4500
885    30.0000
886     7.7500
Name: Fare, Length: 887, dtype: float64

Similarly we can also select multiple columns to create a subset of the original DataFrame. 
Note that we must use double brackets if we want to select multiple columns.

In [7]:
subset_df = df[['Age', 'Sex', 'Survived']]
print(subset_df)

      Age     Sex  Survived
0    22.0    male         0
1    38.0  female         1
2    26.0  female         1
3    35.0  female         1
4    35.0    male         0
..    ...     ...       ...
882  27.0    male         0
883  19.0  female         1
884   7.0  female         0
885  26.0    male         1
886  32.0    male         0

[887 rows x 3 columns]